#+TITLE:bash(1) practice
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:bash(1) practice for CSC420 Operating Systems Spring 2022 Lyon College
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :results output
* Manipulating data

  * [ ] Viewing commands: ~cat~, ~more~, ~less~[fn:3].
    #name+
    #+begin_src bash
      which cat
      which more
      which less
    #+end_src

    #+RESULTS:
    : /usr/bin/cat
    : /usr/bin/more
    : /usr/bin/less

